import sys
import ast
import configparser

# 自作関数の場所をsystempathに追加
sys.path.append("/home/pi/2021/main/my_mod")
# motor制御
from my_motor import Motor
# gpsのデータから目的地までの角度と距離の差異を計算する
from my_waypoint import waypoint

def Autonomy(ard_data, gps_data):

    # 設定ファイル読み込み-------------------------------------------

    INI_FILE = "/home/pi/2021/main/config/config.ini"
    inifile = configparser.SafeConfigParser()
    inifile.read(INI_FILE)

    gps_flag = inifile.get("operation", "gps_flag")
    gps_initial = inifile.get("operation", "gps_initial")

    gps_initial = ast.literal_eval(gps_initial)

    pid_flag = inifile.get("operation", "pid_flag")

    # 設定ファイル読み込み-------------------------------------------


    motor = Motor()


    # gpsによる初期位置修正----------------------------------------------

    if(gps_flag):
        while(True):
            waypoint()

    # gpsによる初期位置修正----------------------------------------------


    # gpsによる潜水地点まで----------------------------------------------
    # gpsによる潜水地点まで----------------------------------------------


    # 潜水--------------------------------------------------------------
    # 潜水--------------------------------------------------------------


    # motor回転数によって潜航(浮上しgpsで目的地じゃなければ潜水しなおし)----
    # motor回転数によって潜航(浮上しgpsで目的地じゃなければ潜水しなおし)----


    # Uターン-----------------------------------------------------------
    # Uターン-----------------------------------------------------------


    # 潜水--------------------------------------------------------------
    # 潜水--------------------------------------------------------------


    # motor回転数によって潜航(浮上しgpsで目的地じゃなければ潜水しなおし)----
    # motor回転数によって潜航(浮上しgpsで目的地じゃなければ潜水しなおし)----


    # gpsによって初期位置へ----------------------------------------------
    # gpsによって初期位置へ----------------------------------------------