#coding: utf-8
import sys

# 自作関数の場所をsystempathに追加
sys.path.append("/home/pi/2021/main/my_mod")
# オペレートファンクション-制御関数
from my_operatfunction import OF

def Autonomy(sen_data):

    of = OF()

    # gpsによる初期位置修正----------------------------------------------
    of.gps_position("initial",sen_data)
    # gpsによる初期位置修正----------------------------------------------


    # senser,pidを用いた初期向き設定---------------------------------
    # gpsによる初期位置修正で傾いた角度を修正
    of.rotate_yaw(0,sen_data)
    # senser,pidを用いた初期向き設定---------------------------------


    # gpsによる潜水地点まで----------------------------------------------
    of.gps_position("diving",sen_data)
    # gpsによる潜水地点まで----------------------------------------------


    # 潜水--------------------------------------------------------------
    # 潜水する深さはコンフィグファイルから変更
    of.diving(sen_data)
    # 潜水--------------------------------------------------------------


    # motor回転数によって潜航(浮上しgpsで目的地じゃなければ潜水しなおし)----
    of.diving_advance("ava_rot",0,sen_data)

    # 浮上
    of.ascend(sen_data)

    # gpsで位置比較 目的地でないとき再び潜水
    of.re_diving("ascend",0,sen_data)
    # motor回転数によって潜航(浮上しgpsで目的地じゃなければ潜水しなおし)----


    # Uターン-----------------------------------------------------------
    of.rotate_yaw(180,sen_data)
    # Uターン-----------------------------------------------------------


    # 潜水--------------------------------------------------------------
    of.diving(sen_data)
    # 潜水--------------------------------------------------------------


    # motor回転数によって潜航(浮上しgpsで目的地じゃなければ潜水しなおし)----
    of.diving_advance("ava_rot",180,sen_data)

    # 浮上
    of.ascend(sen_data)

    #gpsで位置比較 目的地でなければ再び潜水
    of.re_diving("diving",180,sen_data)
    # motor回転数によって潜航(浮上しgpsで目的地じゃなければ潜水しなおし)----


    # gpsによって初期位置へ----------------------------------------------
    of.gps_position("initial",sen_data)
    # gpsによって初期位置へ----------------------------------------------
