#coding: utf-8
import sys
import time
import configparser

# 自作関数の場所をsystempathに追加
sys.path.append("/home/pi/2021/main/my_mod")
# motor制御
from my_motor import Motor
from my_operatfunction import OF

def Teaching(sen_data):

    of = OF()
    motor = Motor()

    # 初期向きの暗記
    time.sleep(3)
    while(not('x' in sen_data)):
        pass

    ini_x = sen_data["x"]

    # 初期向きの反対(Uターンなどで使う)
    if ini_x < 180:
        ini_opx = ini_x+180
    elif ini_x > 180:
        ini_opx = ini_x-180

    # 設定ファイル読み込み-------------------------------------------

    INI_FILE = "/home/pi/2021/main/config/config.ini"
    inifile = configparser.ConfigParser()
    inifile.read(INI_FILE,encoding="utf-8")

    # どのデータを読み込むか
    rotate = eval(inifile.get("teaching","rotate"))

    # 設定ファイル読み込み-------------------------------------------


    # log再生------------------------------------------------------


    # 潜水位置まで-------------------------------------------------
    print("潜水位置まで")
    of.pid_goback_rotate_stop(0,ini_x,sen_data)
    print("潜水位置まで")
    # 潜水位置まで-------------------------------------------------

    # 潜水位置まで潜水---------------------------------------------
    of.diving(sen_data)
    print("潜水")
    # 潜水位置まで潜水---------------------------------------------

    # 浮上位置まで------------------------------------------------
    of.pid_goback_rotate_stop(0,ini_x,sen_data)
    print("浮上位置")
    # 浮上位置まで------------------------------------------------

    # 浮上-------------------------------------------------------
    of.ascend(sen_data)
    print("浮上")
    # 浮上-------------------------------------------------------

    # Uターン----------------------------------------------------
    of.rotate_yaw(ini_opx,sen_data)
    print("Uターン")
    # Uターン----------------------------------------------------

    # 潜水位置まで-------------------------------------------------
    of.pid_goback_rotate_stop(0,ini_x,sen_data)
    print("潜水位置")
    # 潜水位置まで-------------------------------------------------

    # 潜水位置まで潜水---------------------------------------------
    of.diving(sen_data)
    print("潜水")
    # 潜水位置まで潜水---------------------------------------------

    # 浮上位置まで------------------------------------------------
    of.pid_goback_rotate_stop(0,ini_x,sen_data)
    print("浮上位置")
    # 浮上位置まで------------------------------------------------

    # 浮上-------------------------------------------------------
    of.ascend(sen_data)
    print("浮上")
    # 浮上-------------------------------------------------------

    # スタート位置まで--------------------------------------------
    of.pid_goback_rotate_stop(0,ini_x,sen_data)
    print("スタート位置")
    # スタート位置まで--------------------------------------------

    # すべてのモータstop
    motor.stop()

    # log再生------------------------------------------------------

if __name__ == "__main__":
    Teaching()